[ClassDefinition.Class_RocketTechnical VehicleClassDefinition]
DisplayName="Car theft"

[Weapon.WeaponTypes.WeaponType_Rocket VehicleWeaponTypeDefinition]
Typename=" Pirate cars have rocket launchers."
PickupMessage="you do it %s"
PickupMessageWithLevel="You have it %s (level %d)"
UseFailureLevelMessage="You must be level %d to use this feature.."
UseFailureConstraintsMessage="you can't use it."
NoManufacturerName="the head"

[Weapon.WeaponTypes.WeaponType_RocketLauncher WeaponTypeDefinition]
Typename=" Motorcycle thief with missiles"
PickupMessage="It depends on you %s"
PickupMessageWithLevel="you know %s (position %d)"
UseFailureLevelMessage="This item must be used at a minimum level of 100%.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="APPROX"

